# Постарайтесь использовать то, что мы прошли на уроке при решении этого ДЗ,
# вспомните про zip(), map(), lambda, посмотрите где лучше с ними, а где они излишни!

# Задание - 1
# Создайте функцию, принимающую на вход Имя, возраст и город проживания человека
# Функция должна возвращать строку вида "Василий, 21 год(а), проживает в городе Москва"
def biography(name, age, city):
    print(name, age + "год(а)/лет", "проживает в городе", city)


biography(input('Как Вас зовут? '), input('Сколько Вам лет? '), input('Где Вы проживаете? '))


# Задание - 2
# Создайте функцию, принимающую на вход 3 числа, и возвращающую наибольшее из них

def find_max(num1, num2, num3):
    numbers = num1, num2, num3
    bignumber = max(numbers)
    return bignumber


num_1 = int(input('Введите значение первого числа: '))
num_2 = int(input('Введите значение второго числа: '))
num_3 = int(input('Введите значение третьего числа: '))
result = find_max(num_1, num_2, num_3)
print('Большее из введенных чисел равно = ', result)


# Задание - 3
# Создайте функцию, принимающую неограниченное количество строковых аргументов,
# верните самую длинную строку из полученных аргументов

def maxstrlen(*args):
    line = (max(*args, key=len))
    return line


sentence = input("Напишите несколько слов через запятую: ")
new_list = sentence.split(',')
print('Самое длинное введенное слово: ', maxstrlen(new_list))


