# coding=utf-8
# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

a = 8
b = 2
law = 'abiding'
print(a)
print(b)
print(law)

# Задача-2: Запросите от пользователя число, сохраните в переменную,
# прибавьте к числу 2 и выведите результат на экран.
# Если возникла ошибка, прочитайте ее, вспомните урок и постарайтесь устранить ошибку.

answer = int(input('Ваш возраст : '))
print('Через два года Вам будет', answer + 2 )

# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

age = int(input('Ваш возраст : '))
if age >= 18:
    print ('Доступ разрешен!')
elif age <= 0:
    print('Это баловство!')
else:
    print ('Извините, пользование данным ресурсом только с 18 лет')
